CaseLabGreenatom/src/DataProcessors/ВозведениеВСтепень/ВозведениеВСтепень.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВозведениеВСтепень</name>
  <attributes>
    <name>ДвухзначноеЧисло</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Степень</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

CaseLabGreenatom/src/DataProcessors/ВозведениеВСтепень/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВозвестиВСтепень(Команда)
	
	Результат = Pow(Объект.ДвухзначноеЧисло, Объект.Степень);
	
	Если Результат > 10000 Тогда
		
		Сообщить("Превышена верхняя граница!");
		Возврат;
		
	Иначе
		
		Объект.Результат = Результат;
			
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
